//Завдання 1. Система сповіщень
//1. Створіть інтерфейс IMessenger з одним методом SendMessage(string message).
//2. Створіть три класи, що реалізують цей інтерфейс: EmailMessenger, SmsMessenger
//та PushMessenger.
//3. Кожен клас повинен реалізовувати метод SendMessage по-своєму, виводячи в
//консоль відповідне повідомлення (напр., "Відправка Email: [повідомлення]").
//4. У головній програмі створіть List<IMessenger>, додайте до нього об'єкти всіх трьох
//типів та надішліть однакове повідомлення через усі месенджери за допомогою циклу.
//Завдання 2. Ігрові персонажі
//1. Створіть інтерфейс IDamagable з методом TakeDamage(int damageAmount).
//2. Створіть два класи, що реалізують цей інтерфейс: Player(має поле Health) та
//Building(має поле Durability).
//3.Метод TakeDamage у кожному класі повинен зменшувати відповідне поле (здоров'я
//або міцність).
//4. У головній програмі створіть об'єкти гравця та будівлі. Продемонструйте, що
//обидва можуть отримати шкоду, викликавши для них метод TakeDamage.
//Завдання 3. Індивідуальне завдання
//ITransport (метод Move(),
//властивість Speed)

//Car, Bicycle, Boat Створити різні транспортні засоби.

//Продемонструвати їх рух.